package by.training.linearalgorithm.view;

public class Menu {
    public void menu() {
        System.out.println("Выберете номер задачи из предложенных!");
        System.out.println("1. (4) Найдите значение функции: z = ( (a – 3 ) * b / 2) + c.");
        System.out.println("2. (12) Вычислить расстояние между двумя точками с данными координатами (х1, у1) и (x2, у2).");
        System.out.println("3. (20) Известна длина окружности. Найти площадь круга, ограниченного этой окружностью.");
        System.out.println("4. (28) Составить программу перевода радианной меры угла в градусы, минуты и секунды.");
        System.out.println("5. (36) Найти частное произведений четных и нечетных цифр четырехзначного числа.");
        System.out.println("Нажмите 0 для выхода.");
    }
}
